Revit 2027 API
StairsRun.GetLeftSupports Method
 Retrieves all supports on the left side of run boundaries.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetLeftSupports()
Public Function GetLeftSupports As IList(Of ElementId)
public:
IList<ElementId^>^ GetLeftSupports()
member GetLeftSupports : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The supports on the left side of run boundaries.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace